Revit 2026 API

# AnalysisDisplayDeformedShapeSettingsGridColor Property

---

Color of grid lines.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color GridColor { get; set; }
```
```vb
Public Property GridColor As Color
	Get
	Set
```
```cpp
public:
property Color^ GridColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member GridColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace